espressif/arduino-esp32/libraries/BLE/src/BLEClient.cpp
      return 0;
    }  // BLE_GAP_EVENT_NOTIFY_RX

    case BLE_GAP_EVENT_CONN_UPDATE_REQ:
    case BLE_GAP_EVENT_L2CAP_UPDATE_REQ:
    {
      if (client->m_conn_id != event->conn_update_req.conn_handle) {
        return 0;
      }
      log_d("Peer requesting to update connection parameters");
      log_d(
        "MinInterval: %d, MaxInterval: %d, Latency: %d, Timeout: %d", event->conn_update_req.peer_params->itvl_min,
        event->conn_update_req.peer_params->itvl_max, event->conn_update_req.peer_params->latency, event->conn_update_req.peer_params->supervision_timeout
      );

      rc = client->m_pClientCallbacks->onConnParamsUpdateRequest(client, event->conn_update_req.peer_params) ? 0 : BLE_ERR_CONN_PARMS;

      if (!rc && event->type == BLE_GAP_EVENT_CONN_UPDATE_REQ) {
        event->conn_update_req.self_params->itvl_min = client->m_pConnParams.itvl_min;
        event->conn_update_req.self_params->itvl_max = client->m_pConnParams.itvl_max;
        event->conn_update_req.self_params->latency = client->m_pConnParams.latency;
        event->conn_update_req.self_params->supervision_timeout = client->m_pConnParams.supervision_timeout;
      }

      log_d("%s peer params", (rc == 0) ? "Accepted" : "Rejected");
      return rc;
    }  // BLE_GAP_EVENT_CONN_UPDATE_REQ, BLE_GAP_EVENT_L2CAP_UPDATE_REQ

    case BLE_GAP_EVENT_CONN_UPDATE:
    {
      if (client->m_conn_id != event->conn_update.conn_handle) {
        return 0;
      }
      if (event->conn_update.status == 0) {
        log_i("Connection parameters updated.");
      } else {
        log_e("Update connection parameters failed.");
      }
      return 0;
    }  // BLE_GAP_EVENT_CONN_UPDATE

    case BLE_GAP_EVENT_ENC_CHANGE:
    {
      if (client->m_conn_id != event->enc_change.conn_handle) {
        return 0;
      }

      if (event->enc_change.status == 0 || event->enc_change.status == (BLE_HS_ERR_HCI_BASE + BLE_ERR_PINKEY_MISSING)) {
        struct ble_gap_conn_desc desc;
        rc = ble_gap_conn_find(event->enc_change.conn_handle, &desc);
        assert(rc == 0);

        if (event->enc_change.status == (BLE_HS_ERR_HCI_BASE + BLE_ERR_PINKEY_MISSING)) {
          // Key is missing, try deleting.
          ble_store_util_delete_peer(&desc.peer_id_addr);
        } else if (BLEDevice::m_securityCallbacks != nullptr) {
          BLEDevice::m_securityCallbacks->onAuthenticationComplete(&desc);
        } else {
          client->m_pClientCallbacks->onAuthenticationComplete(&desc);
        }
      }

      rc = event->enc_change.status;
      break;
    }  //BLE_GAP_EVENT_ENC_CHANGE

    case BLE_GAP_EVENT_MTU:
    {
      if (client->m_conn_id != event->mtu.conn_handle) {
        return 0;
      }
      log_i("mtu update event; conn_handle=%d mtu=%d", event->mtu.conn_handle, event->mtu.value);
      rc = 0;
      break;
    }  // BLE_GAP_EVENT_MTU

    case BLE_GAP_EVENT_PASSKEY_ACTION:
    {
      struct ble_sm_io pkey = {0, 0};

      if (client->m_conn_id != event->passkey.conn_handle) {
        return 0;
      }

      if (event->passkey.params.action == BLE_SM_IOACT_DISP) {
        pkey.action = event->passkey.params.action;
        pkey.passkey = BLESecurity::m_passkey;  // This is the passkey to be entered on peer
        rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
        log_d("ble_sm_inject_io result: %d", rc);

      } else if (event->passkey.params.action == BLE_SM_IOACT_NUMCMP) {
        log_d("Passkey on device's display: %d", event->passkey.params.numcmp);
        pkey.action = event->passkey.params.action;
        // Compatibility only - Do not use, should be removed the in future
        if (BLEDevice::m_securityCallbacks != nullptr) {
          pkey.numcmp_accept = BLEDevice::m_securityCallbacks->onConfirmPIN(event->passkey.params.numcmp);
          ////////////////////////////////////////////////////
        } else {
          pkey.numcmp_accept = client->m_pClientCallbacks->onConfirmPIN(event->passkey.params.numcmp);
        }

        rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
        log_d("ble_sm_inject_io result: %d", rc);

        //TODO: Handle out of band pairing
      } else if (event->passkey.params.action == BLE_SM_IOACT_OOB) {
        static uint8_t tem_oob[16] = {0};
        pkey.action = event->passkey.params.action;
        for (int i = 0; i < 16; i++) {
          pkey.oob[i] = tem_oob[i];
        }
        rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
        log_d("ble_sm_inject_io result: %d", rc);
        ////////
      } else if (event->passkey.params.action == BLE_SM_IOACT_INPUT) {
        log_d("Enter the passkey");
        pkey.action = event->passkey.params.action;

        // Compatibility only - Do not use, should be removed the in future
        if (BLEDevice::m_securityCallbacks != nullptr) {
          pkey.passkey = BLEDevice::m_securityCallbacks->onPassKeyRequest();
          /////////////////////////////////////////////
        } else {
          pkey.passkey = client->m_pClientCallbacks->onPassKeyRequest();
        }

        rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
        log_d("ble_sm_inject_io result: %d", rc);

      } else if (event->passkey.params.action == BLE_SM_IOACT_NONE) {
        log_d("No passkey action required");
      }

      return 0;
    }  // BLE_GAP_EVENT_PASSKEY_ACTION

    default:
    {
      return 0;
    }
  }  // Switch

  if (client->m_pTaskData != nullptr) {
    client->m_pTaskData->rc = rc;
    if (client->m_pTaskData->task) {
      xTaskNotifyGive(client->m_pTaskData->task);
    }
    client->m_pTaskData = nullptr;
  }

  return 0;
}  // handleGAPEvent

/**
 * @brief Disconnect from the peer.
 * @return Error code from NimBLE stack, 0 = success.
 */
int BLEClient::disconnect(uint8_t reason) {
  log_d(">> disconnect()");
  int rc = 0;
  if(isConnected()) {
    // If the timer was already started, ignore this call.
    if(ble_npl_callout_is_active(&m_dcTimer)) {
      log_i("Already disconnecting, timer started");
      return BLE_HS_EALREADY;
    }

    ble_gap_conn_desc desc;
    if(ble_gap_conn_find(m_conn_id, &desc) != 0){
      log_i("Connection ID not found");
      return BLE_HS_EALREADY;
    }

    // We use a timer to detect a controller error in the event that it does
    // not inform the stack when disconnection is complete.
    // This is a common error in certain esp-idf versions.
    // The disconnect timeout time is the supervison timeout time + 1 second.
    // In the case that the event happenss shortly after the supervision timeout
    // we don't want to prematurely reset the host.
    ble_npl_time_t ticks;
    ble_npl_time_ms_to_ticks((desc.supervision_timeout + 100) * 10, &ticks);
    ble_npl_callout_reset(&m_dcTimer, ticks);

    rc = ble_gap_terminate(m_conn_id, reason);
    if (rc != 0) {
      if(rc != BLE_HS_EALREADY) {
        ble_npl_callout_stop(&m_dcTimer);
      }
      log_e("ble_gap_terminate failed: rc=%d %s", rc, BLEUtils::returnCodeToString(rc));
    } else {
      log_d("Not connected to any peers");
    }
  }

  log_d("<< disconnect()");
  m_lastErr = rc;
  return rc;
} // disconnect

bool BLEClientCallbacks::onConnParamsUpdateRequest(BLEClient *pClient, const ble_gap_upd_params *params) {
  log_d("BLEClientCallbacks", "onConnParamsUpdateRequest: default");
  return true;
}

uint32_t BLEClientCallbacks::onPassKeyRequest(){
  log_d("onPassKeyRequest: default: 123456");
  return 123456;
}

void BLEClientCallbacks::onAuthenticationComplete(ble_gap_conn_desc* desc){
  log_d("onAuthenticationComplete: default");
}

bool BLEClientCallbacks::onConfirmPIN(uint32_t pin){
  log_d("onConfirmPIN: default: true");
  return true;
}

#endif  // CONFIG_NIMBLE_ENABLED

#endif /* CONFIG_BLUEDROID_ENABLED || CONFIG_NIMBLE_ENABLED */
#endif /* SOC_BLE_SUPPORTED */
